{
    "projects":
    [
        {
            "title": "Jazmyn - Voice Controlled Web Broswing Plugin",
            "desc": "For Artificial Intelligence, my partner and I utilized an existing voice-recognition API but created functionality where vocalized commands could be translated to machine actions, recorded, and recalled.",
            "images": 
            [
                {"item": "images/webapi.jpg"}, 
                {"item": "images/webAPI.jpg"}, 
                {"item": "images/microphone.jpg"}
            ]
        },
        {
            "title": "Peer-2-Peer Chat Server w/Group Message Capabilities",
            "desc": "For Object-Oriented Design, I created Java code that made and hosted a chat server on multicast sockets in an existing network that would identify other users running the same program and allowed for exchange of direct messages or group messages",
            "images": 
            [
                {"item": "images/cserverpixelated.jpg"}, 
                {"item": "images/cServerPixelated.jpg"}, 
                {"item": "images/CServer.jpg"}
            ]

        },
        {
            "title": "History Sniffing Chess Board",
            "desc": "For Information Security, I created a webpage that mimicked a CAPTCHA but could determine if the unassuming user had been to any subset of a list of links and would supply a message dependent on what parts of the chess board were clicked.",
            "images": 
            [
                {"item": "images/chessboard.jpg"}, 
                {"item": "images/chessBoard.jpg"}, 
                {"item": "images/hSniff.jpg"}
            ]
        },
        {
            "title": "Plagues, Prophets and People: High Priest Visual Journal",
            "desc": "For a Theology class that I took in Israel, I created a Visual Journal to document the life of ancient Jewish High Priests and the restrictions that they encountered in daily life",
            "images": 
            [
                {"item": "images/qumran(1).jpg"}, 
                {"item": "images/qumran.jpg"}, 
                {"item": "images/sarc.jpg"}
            ]
        },
        {
            "title": "Intercultural Identity Paper",
            "desc": "For Intercultural Communication, I wrote a paper exploring and defining Intercultural Identity which is the simoultaneous and continous definition of 'us' versus 'them' in all of life's contexts",
            "images": 
            [
                {"item": "images/ici(1).jpg"}, 
                {"item": "images/ici.jpg"}, 
                {"item": "images/iciQuote.jpg"}
            ]
        },
        {
            "title": "Center for the Common Good",
            "desc": "The entirety of Project Management was seeing a project through its entire lifecycle. My group members and I were paired with the Center of the Common Good at the University of St. Thomas. They were looking for help in engagement with their main users - Students, Faculty, and Community Partner Service Organizations. We created frameworks for them to implement that would improve engagement in all 3 areas.",
            "images": 
            [
                {"item": "images/ccg(1).jpg"}, 
                {"item": "images/ccg.jpg"}, 
                {"item": "images/ccgVol.jpg"}
            ]
        },
        {
            "title": "Net Neutrality Investigation",
            "desc": "For Business Law, my group members and I investigated the potential implications that could accompany a policy change regarding Net Neutrality",
            "images": 
            [
                {"item": "images/cpis(1).jpg"}, 
                {"item": "images/cpis.jpg"}, 
                {"item": "images/Net-Neutrality.jpg"}
            ]
        }
    ]
}
